---
kind: method
id: M:Autodesk.Revit.DB.Analysis.EnergyAnalysisOpening.GetConstruction
source: html/617b3b8e-ae52-4582-7c49-957fc70a9d14.htm
---
# Autodesk.Revit.DB.Analysis.EnergyAnalysisOpening.GetConstruction Method

Gets the analytic construction this surface is associated with.

## Syntax (C#)
```csharp
public EnergyAnalysisConstruction GetConstruction()
```

## Returns
The analytic construction.